In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'apple':[102,500,250,75],'grapes':[50,150,90,45]}
df = pd.DataFrame(data)

In [3]:
df

   apple  grapes
0    102      50
1    500     150
2    250      90
3     75      45

In [7]:
df['grapes']

0     50
1    150
2     90
3     45
Name: grapes, dtype: int64

In [5]:
df['banana'] = df['grapes'] + 50

In [6]:
df

   apple  grapes  banana
0    102      50     100
1    500     150     200
2    250      90     140
3     75      45      95

In [8]:
df.drop(['banana'], axis=1)

   apple  grapes
0    102      50
1    500     150
2    250      90
3     75      45

In [9]:
df

   apple  grapes  banana
0    102      50     100
1    500     150     200
2    250      90     140
3     75      45      95

In [10]:
df.drop(['banana'], axis=1, inplace=True)

In [11]:
df

   apple  grapes
0    102      50
1    500     150
2    250      90
3     75      45